apps/api-firma/app/services/json_web_token.rb

SELECT 1 AS one FROM "token_blacklists" WHERE "token_blacklists"."jti" = $1 LIMIT $2  [["jti", "b604d35c-3526-49ae-9490-371581265bc0"], ["LIMIT", 1]]
---
    def blacklisted?(jti)
      TokenBlacklist.exists?(jti: jti)