apps/api-firma/app/services/dte/asignador_folios.rb

    def obtener_tipo_documento
      TipoDocumento.find_by(codigo: tipo_documento.to_s)
---
SELECT "tipo_documentos".* FROM "tipo_documentos" WHERE "tipo_documentos"."codigo" = $1 LIMIT $2  [["codigo", "33"], ["LIMIT", 1]]

    def obtener_tipo_habilitado(tipo_doc_id)
      TipoHabilitado.find_by(
        empresa_id: empresa_id,
        tipo_documento_id: tipo_doc_id
      )
---
SELECT "tipo_habilitados".* FROM "tipo_habilitados" WHERE "tipo_habilitados"."empresa_id" = $1 AND "tipo_habilitados"."tipo_documento_id" = $2 LIMIT $3  [["empresa_id", 1], ["tipo_documento_id", 1], ["LIMIT", 1]]

    def asignar_folios_disponibles(tipo_habilitado)
      cantidad_requerida = paginas.count
      saldo = cantidad_requerida          # Folios que aún faltan por asignar
      indice_pagina = 0
      folios_usados = []

      # fa = folio autorizado inicial del rango CAF
      rangos_folio = RangoFolio.where(tipo_habilitado_id: tipo_habilitado.id).order('fa ASC')

      rangos_folio.each do |rango|
        break if saldo <= 0

        folios_disponibles = Folio.where(rango_folio_id: rango.id, disponible: true)
                                  .order('numero ASC')

        next if folios_disponibles.empty?
---
SELECT "rango_folios".* FROM "rango_folios" WHERE "rango_folios"."tipo_habilitado_id" = $1 ORDER BY fa ASC  [["tipo_habilitado_id", 40]]
SELECT "folios".* FROM "folios" WHERE "folios"."rango_folio_id" = $1 AND "folios"."disponible" = $2 ORDER BY numero ASC  [["rango_folio_id", 22], ["disponible", true]]
SELECT 1 AS one FROM "folios" WHERE "folios"."rango_folio_id" = $1 AND "folios"."disponible" = $2 LIMIT $3  [["rango_folio_id", 22], ["disponible", true], ["LIMIT", 1]]