apps/api-firma/app/services/dte/firmador.rb

SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = $1 LIMIT $2  [["id", 152], ["LIMIT", 1]]
---
    def call
      Rails.logger.info "=== FIRMADOR: Iniciando firma de DTE ==="

      # Parsear XML
      @xml = Nokogiri::XML(@xml_string)
      @xml.encoding = 'ISO-8859-1'

      # Obtener certificado de la empresa
      empresa = Empresa.find(@empresa_id)

SELECT "rango_folios".* FROM "rango_folios" WHERE "rango_folios"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
---
    def insertar_caf(doc_index, rango_folio_id)
      Rails.logger.info "=== FIRMADOR: Insertando CAF para documento #{doc_index} ==="

      # Obtener el rango de folio con el archivo CAF
      rango = RangoFolio.find(rango_folio_id)