apps/api-firma/app/controllers/api/v1/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "max.munro@gmail.com"], ["LIMIT", 1]]
---
      def find_user_by_credentials
        if login_params[:email].present?
          User.find_by(email: login_params[:email])

INSERT INTO "refresh_tokens" ("user_id", "token", "expires_at", "revoked_at", "user_agent", "ip_address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
      def generate_tokens(user)
        payload = token_payload(user)

        # Generar access token (JWT)
        access_token = JsonWebToken.encode_access_token(payload)
        access_exp = JsonWebToken.expiration_time(access_token)

        # Crear refresh token en BD
        refresh_token = user.refresh_tokens.create!

SELECT "roles"."codigo" FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."rol_id" WHERE "user_roles"."user_id" = $1  [["user_id", 1]]
---
      def token_payload(user)
        {
          user_id: user.id,
          email: user.email,
          username: user.username,
          empresa_id: user.empresa_id,
          roles: user.roles.pluck(:codigo)

SELECT "roles"."codigo" FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."rol_id" WHERE "user_roles"."user_id" = $1  [["user_id", 1]]
---
      def user_payload(user)
        {
          id: user.id,
          email: user.email,
          username: user.username,
          lenguaje: user.lenguaje,
          empresa_id: user.empresa_id,
          empresa: user.empresa&.razon_social,
          roles: user.roles.pluck(:codigo),
          persona: user.persona ? {

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def authenticate_token
        token = extract_token_from_header
        raise JsonWebToken::TokenInvalidError, 'Token no proporcionado' if token.blank?

        payload = JsonWebToken.decode(token)

        if JsonWebToken.blacklisted?(payload[:jti])
          raise JsonWebToken::TokenInvalidError, 'Token revocado'
        end

        user = User.find_by(id: payload[:user_id])