apps/api-firma/app/controllers/api/v1/certificados_controller.rb

INSERT INTO "certificados" ("user_id", "fecha_adjuncion", "vigente", "fecha_caducacion", "responsable", "frase_clave") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["fecha_adjuncion", "2026-02-17 15:47:04.644319"], ["vigente", true], ["fecha_caducacion", nil], ["responsable", "mmunro"], ["frase_clave", "OlfMunro123"]]
---
          )

          attach_certificate_files!(certificado)
          certificado.save!