apps/api-firma/app/controllers/api/v1/certificados_controller.rb

      def crear
        Rails.logger.info "=== CREAR CERTIFICADO: INICIO ==="

        # Validar parámetros requeridos
        return error_parametros('user_id es requerido') unless params[:user_id].present?
        return error_parametros('archivo_crs es requerido') unless params[:archivo_crs].present?
        return error_parametros('archivo_key es requerido') unless params[:archivo_key].present?
        return error_parametros('frase_clave es requerida') unless params[:frase_clave].present?

        Rails.logger.info "=== PASO 1: Parámetros validados ==="

        # Buscar usuario
        user = User.find_by(id: params[:user_id])
        return error_no_encontrado('Usuario no encontrado') unless user

        Rails.logger.info "=== PASO 2: Usuario encontrado: #{user.id} ==="

        # Verificar que el usuario pertenece a una empresa
        return error_validacion('El usuario no tiene empresa asignada') unless user.empresa_id.present?

        Rails.logger.info "=== PASO 3: Usuario tiene empresa: #{user.empresa_id} ==="

        Certificado.transaction do
          Rails.logger.info "=== PASO 4: Inicio transaction ==="

          # Desactivar certificados anteriores del usuario
          user.certificados.vigentes.update_all(vigente: false)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "certificados" SET "vigente" = $1 WHERE "certificados"."user_id" = $2 AND "certificados"."vigente" = $3  [["vigente", false], ["user_id", 1], ["vigente", true]]

          Rails.logger.info "=== PASO 10: Archivos escritos en disco ==="

          # Crear blobs manualmente
          crs_blob = ActiveStorage::Blob.create!(
            key: crs_key,
            filename: params[:archivo_crs].original_filename,
            content_type: 'application/x-pem-file',
            byte_size: crs_content.bytesize,
            checksum: Digest::MD5.base64digest(crs_content),
            service_name: 'test'
          )
          Rails.logger.info "=== PASO 11: Blob CRS creado: #{crs_blob.id} ==="

          key_blob = ActiveStorage::Blob.create!(
            key: key_key,
            filename: params[:archivo_key].original_filename,
            content_type: 'application/x-pem-file',
            byte_size: key_content.bytesize,
            checksum: Digest::MD5.base64digest(key_content),
            service_name: 'test'
          )
          Rails.logger.info "=== PASO 12: Blob KEY creado: #{key_blob.id} ==="

          # Asociar blobs al certificado
          certificado.archivo_crs.attach(crs_blob)
---
INSERT INTO "active_storage_blobs" ("key", "filename", "content_type", "metadata", "byte_size", "checksum", "created_at", "service_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "certificados" ("user_id", "fecha_adjuncion", "vigente", "fecha_caducacion", "responsable", "frase_clave") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["fecha_adjuncion", "2026-02-17 22:10:08.803629"], ["vigente", true], ["fecha_caducacion", nil], ["responsable", "mmunro"], ["frase_clave", "OlfMunro123"]]

          Rails.logger.info "=== PASO 13: Blobs asociados ==="

          # Guardar primero para persistir los attachments
          certificado.save!
---
INSERT INTO "certificados" ("user_id", "fecha_adjuncion", "vigente", "fecha_caducacion", "responsable", "frase_clave") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["fecha_adjuncion", "2026-02-18 17:10:37.667106"], ["vigente", true], ["fecha_caducacion", nil], ["responsable", "mmunro"], ["frase_clave", "OlfMunro123"]]

          unless certificado.clave_privada
            Rails.logger.info "=== ERROR: Clave privada inválida ==="
            # Eliminar el certificado si la clave no es válida
            certificado.destroy
---
DELETE FROM "certificados" WHERE "certificados"."id" = $1  [["id", 21]]