apps/api-firma/app/controllers/api/v1/dte_controller.rb

      def preparar
        archivo_temp = nil

        # Validaciones
        errores = validar_params_preparar
        return render json: { success: false, errors: errores }, status: :unprocessable_entity if errores.any?

        empresa = Empresa.find_by(id: params[:empresa_id])
---
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = $1 LIMIT $2  [["id", 152], ["LIMIT", 1]]

      def generar_xml
        @archivos_temporales = []

        # Validaciones
        errores = validar_params_preparar
        return render json: { success: false, errors: errores }, status: :unprocessable_entity if errores.any?

        empresa = Empresa.includes(:acteco_empresas, actecos: []).find_by(id: params[:empresa_id])
---
SELECT "acteco_empresas".* FROM "acteco_empresas" WHERE "acteco_empresas"."empresa_id" = $1  [["empresa_id", 152]]
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = $1 LIMIT $2  [["id", 152], ["LIMIT", 1]]