apps/api-firma/app/controllers/api/v1/dte_controller.rb

      def generar_xml
        @archivos_temporales = []

        errores = validar_params_preparar
        if errores.any?
          auditar_dte_fallo(
            accion: Auditoria::Acciones::DTE_GENERAR_XML,
            mensaje: errores.join(', '),
            metadata: { fase: 'validacion' }
          )
          return render json: { success: false, errors: errores }, status: :unprocessable_entity
        end

        empresa = Empresa.includes(:acteco_empresas, actecos: []).find_by(id: params[:empresa_id])
---
SELECT "acteco_empresas".* FROM "acteco_empresas" WHERE "acteco_empresas"."empresa_id" = $1  [["empresa_id", 152]]
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = $1 LIMIT $2  [["id", 152], ["LIMIT", 1]]