apps/api-firma/app/controllers/api/v1/rango_folios_controller.rb

SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = $1 LIMIT $2  [["id", 152], ["LIMIT", 1]]
SELECT "rango_folios".* FROM "rango_folios" WHERE "rango_folios"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
SELECT 1 AS one FROM "rango_folios" WHERE "rango_folios"."archivo" = $1 AND "rango_folios"."empresa_id" = $2 LIMIT $3  [["archivo", "33.xml"], ["empresa_id", 152], ["LIMIT", 1]]
---
      def cargar
        Rails.logger.info "=== RANGO_FOLIOS: Iniciando carga de CAF ==="

        # Validar parámetros
        unless params[:archivo].present?
          return render json: { success: false, error: 'Debe adjuntar un archivo CAF' }, status: :unprocessable_entity
        end

        unless params[:empresa_id].present?
          return render json: { success: false, error: 'empresa_id es requerido' }, status: :unprocessable_entity
        end

        empresa = Empresa.find_by(id: params[:empresa_id])
        unless empresa
          return render json: { success: false, error: 'Empresa no encontrada' }, status: :not_found
        end

        archivo = params[:archivo]
        nombre_original = archivo.original_filename

        # Verificar que sea un archivo XML
        unless nombre_original.downcase.end_with?('.xml')
          return render json: { success: false, error: 'El archivo debe ser un XML' }, status: :unprocessable_entity
        end

        # Verificar si el archivo ya existe
        if RangoFolio.exists?(archivo: nombre_original, empresa_id: empresa.id)

SELECT "tipo_documentos".* FROM "tipo_documentos" WHERE "tipo_documentos"."codigo" = $1 LIMIT $2  [["codigo", "33"], ["LIMIT", 1]]
---
          end

          # Buscar TipoDocumento
          tipo_documento = TipoDocumento.find_by(codigo: td)

SELECT "tipo_habilitados".* FROM "tipo_habilitados" WHERE "tipo_habilitados"."empresa_id" = $1 AND "tipo_habilitados"."tipo_documento_id" = $2 LIMIT $3  [["empresa_id", 152], ["tipo_documento_id", 1], ["LIMIT", 1]]
---
          end

          # Verificar que el tipo esté habilitado para la empresa
          tipo_habilitado = TipoHabilitado.find_by(empresa_id: empresa.id, tipo_documento_id: tipo_documento.id)

SELECT "rango_folios".* FROM "rango_folios" WHERE "rango_folios"."tipo_habilitado_id" = $1 AND ((d <= 1 AND h >= 1) OR (d <= 20 AND h >= 20) OR (d >= 1 AND h <= 20)) ORDER BY "rango_folios"."id" ASC LIMIT $2  [["tipo_habilitado_id", 40], ["LIMIT", 1]]
---
          end

          # Verificar que no se traslapen rangos
          rango_existente = RangoFolio.where(tipo_habilitado_id: tipo_habilitado.id)
                                       .where('(d <= ? AND h >= ?) OR (d <= ? AND h >= ?) OR (d >= ? AND h <= ?)',
                                              d, d, h, h, d, h)
                                       .first

INSERT INTO "folios" ("numero", "usado", "rango_folio_id", "anulado", "empresa_id", "tipo_habilitado_id", "reservado", "disponible") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["numero", 1], ["usado", false], ["rango_folio_id", 23], ["anulado", false], ["empresa_id", 152], ["tipo_habilitado_id", 40], ["reservado", false], ["disponible", true]]
INSERT INTO "rango_folios" ("empresa_id", "td", "d", "h", "fa", "rsask", "rsapubk", "tipo_habilitado_id", "fecha_uso", "archivo", "username", "fecha_subida") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
          # Crear RangoFolio y Folios en transacción
          rango_folio = nil
          RangoFolio.transaction do
            rango_folio = RangoFolio.create!(
              empresa_id: empresa.id,
              td: td,
              d: d,
              h: h,
              fa: Date.strptime(fa, '%Y-%m-%d'),
              rsask: rsask,
              rsapubk: rsapubk,
              tipo_habilitado_id: tipo_habilitado.id,
              fecha_uso: nil,
              archivo: nombre_original,
              username: username,
              fecha_subida: Time.current
            )

INSERT INTO "folios" ("numero", "usado", "rango_folio_id", "anulado", "empresa_id", "tipo_habilitado_id", "reservado", "disponible") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["numero", 1], ["usado", false], ["rango_folio_id", 23], ["anulado", false], ["empresa_id", 152], ["tipo_habilitado_id", 40], ["reservado", false], ["disponible", true]]
---
            # Crear folios individuales
            folios_creados = 0
            (d..h).each do |numero|
              Folio.create!(
                numero: numero,
                disponible: true,
                reservado: false,
                usado: false,
                anulado: false,
                rango_folio_id: rango_folio.id,
                empresa_id: empresa.id,
                tipo_habilitado_id: tipo_habilitado.id
              )

INSERT INTO "active_storage_blobs" ("key", "filename", "content_type", "metadata", "byte_size", "checksum", "created_at", "service_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
      def guardar_archivo_caf(rango_folio, archivo, nombre_original)
        contenido = archivo.read
        archivo.rewind

        storage_root = Rails.root.join('tmp', 'storage')
        caf_key = SecureRandom.alphanumeric(28)
        caf_path = storage_root.join(caf_key[0..1], caf_key[2..3], caf_key)

        FileUtils.mkdir_p(File.dirname(caf_path))
        File.binwrite(caf_path, contenido)

        caf_blob = ActiveStorage::Blob.create!(
          key: caf_key,
          filename: nombre_original,
          content_type: 'application/xml',
          byte_size: contenido.bytesize,
          checksum: Digest::MD5.base64digest(contenido),
          service_name: 'test'
        )